import translate from '@vitalets/google-translate-api';
import fetch from 'node-fetch';
const handler = async (m, {conn, command}) => {
  if (command === 'نصيحه') {
    const consejo = consejos[Math.floor(Math.random() * consejos.length)];
    const mensaje = `╭─◆────◈⚘◈─────◆─╮\n\n⠀⠀🌟 *نصيحة اليوم* 🌟\n\n❥ ${consejo}\n\n╰─◆────◈⚘◈─────◆─╯`;
    await m.reply(mensaje);
  }

  if (command === 'عباره-رومانسيه') {
    const frase_romantica = frasesromanticas[Math.floor(Math.random() * frasesromanticas.length)];
    const mensaje = `╭─◆────◈⚘◈─────◆─╮\n\n⠀⠀💖 *عبارة رومانسية* 💖\n\n❥ ${frase_romantica}\n\n╰─◆────◈⚘◈─────◆─╯`;
    await m.reply(mensaje);
  }

  if (command == 'historiaromantica') {
    try {
      const cerpe = await cerpen(`cinta romantis`);
      const storytime = await translate(cerpe.cerita, {to: 'ar', autoCorrect: true}).catch((_) => null);
      const titletime = await translate(cerpe.title, {to: 'ar', autoCorrect: true}).catch((_) => null);
      conn.reply(m.chat, `᭥🫐᭢ Título: ${titletime.text}
᭥🍃᭢ Autor: ${cerpe.author}
────────────────
${storytime.text}`, m);
    } catch {
      const err = await fetch(`https://api.lolhuman.xyz/api/openai?apikey=${lolkeysapi}&text=Elabora%20una%20historia%20romantica%20que%20use%20el%20siguiente%20formato:%20%E1%AD%A5%F0%9F%AB%90%E1%AD%A2%20T%C3%ADtulo:%20%E1%AD%A5%F0%9F%8D%83%E1%AD%A2%20Autor:%20%E2%94%80%E2%94%80%E2%94%80%E2%94%80%E2%94%80%E2%94%80%E2%94%80%E2%94%80%E2%94%80%E2%94%80%E2%94%80%E2%94%80%E2%94%80%E2%94%80%E2%94%80%E2%94%80%20hsitoria...%20adalah&user=user-unique-id`);
      const json = await err.json();
      const fraseChat = json.result;
      conn.reply(m.chat, fraseChat, m);
    }
  }
};
handler.tags = ['frases'];
handler.command = handler.help = ['رومانسي', 'عباره-رومانسيه', 'historiaromantica'];
export default handler;

async function cerpen(category) {
  return new Promise((resolve, reject) => {
    const title = category.toLowerCase().replace(/[()*]/g, '');
    const judul = title.replace(/\s/g, '-');
    const page = Math.floor(Math.random() * 5);
    axios.get('http://cerpenmu.com/category/cerpen-'+judul+'/page/'+page)
        .then((get) => {
          const $ = cheerio.load(get.data);
          const link = [];
          $('article.post').each(function(a, b) {
            link.push($(b).find('a').attr('href'));
          });
          const random = link[Math.floor(Math.random() * link.length)];
          axios.get(random).then((res) => {
            const $$ = cheerio.load(res.data);
            const hasil = {
              title: $$('#content > article > h1').text(),
              author: $$('#content > article').text().split('Cerpen Karangan: ')[1].split('Kategori: ')[0],
              kategori: $$('#content > article').text().split('Kategori: ')[1].split('\n')[0],
              lolos: $$('#content > article').text().split('Lolos moderasi pada: ')[1].split('\n')[0],
              cerita: $$('#content > article > p').text(),
            };
            resolve(hasil);
          });
        });
  });
}

global.frasesromanticas = [
  'أنت النور الذي ينير حياتي في الظلام.',
  'معك، كل يوم هو مغامرة جديدة مليئة بالحب.',
  'عيناك هي انعكاس السماء التي أريد أن أضيع فيها.',
  'كل نبضة في قلبي تحمل اسمك.',
  'بين ذراعيك وجدت المنزل الذي طالما بحثت عنه.',
  'أنت الحلم الذي لا أريد أن أستيقظ منه أبداً.',
  'الحب الحقيقي هو أن نكون معًا في السراء والضراء.',
  'لا توجد مسافات عندما يكون القلبان متحدين.',
  'قبلاتك هي اللحن الذي يسرع قلبي.',
  'الحب هو أن ترى في نفسك ما لا يستطيع أحد أن يراه.',
  'في كل نبضة قلب آخذك معي في كل مكان.',
  'الحب الذي أشعر به تجاهك هو قوتي وملهمتي.',
  'كلماتك العذبة هي غذاءي العاطفي اليومي.',
  'أنت أغلى هدية قدمتها لي الحياة.',
  'الوقت يتوقف عندما أكون بجانبك.',
  'في ابتسامتك أجد السعادة التي كنت أبحث عنها.',
  'كل يوم بجانبك هو قصة حب لا تنتهي.',
  'حبنا مثل حكاية خرافية تتحقق.',
  'عناقك هو ملجأي في هذا العالم الفوضوي.',
  'أنت سبب إيماني بالقدر.',
  'الحب هو أن تكتشف كل يوم شيئًا جديدًا أحبه فيك.',
  'حبك هو اللوحة الفارغة التي أرسم فيها سعادتي.',
  'معك يكون المستقبل طريقاً مليئاً بالوعود والأحلام.',
  'أنت المنارة التي تهدي قلبي في الظلام.',
  'سحر الحب موجود في كل لفتة نشاركها.',
  'حبنا هو رقصة أبدية من العاطفة والحنان.',
  'بين ذراعيك يختفي العالم كله ولا يوجد إلا أنت وأنا.',
  'الحب هو اللغة التي تتحدث بها قلوبنا.',
  'أنت القطعة الصغيرة التي كنت أفتقدها لإكمال روحي.',
  'الحب هو أن أجد فيك كل ما لم أكن أعلم أنني بحاجة إليه.',
];

global.consejos = [
  'تقبل أن التغييرات جزء طبيعي من الحياة، وتعلم التكيف معها.',
  'لا تتوقف عن التعلم؛ المعرفة هي أداة قوية.',
  'اعتني بصحتك الجسدية والعقلية، فهي ضرورية لحياة كاملة.',
  'استمتع بالأشياء الصغيرة، لأنها هي التي تعطي معنى للحياة.',
  'تعلم أن تسامح الآخرين ونفسك، لتحرر قلبك.',
  'قم بتقدير الوقت الذي تقضيه مع أحبائك، فهو أثمن هدية يمكنك تقديمها وتلقيها.',
  'كن لطيفًا ورحيمًا مع الآخرين، فكل عمل طيب يمكن أن يحدث فرقًا في حياتهم.',
  'تعلم أن تقول "لا" عند الضرورة، وضع حدودًا صحية.',
  'ابحث عن الوقت للقيام بما تحبه، لأن ذلك يغذي روحك ويجعلك تشعر بالحياة.',
  'لا تقارن نفسك بالآخرين، فلكل شخص طريقه وإيقاعه الخاص في الحياة.',
  'استمعي لشريكك بتعاطف وتفهم، فالتواصل هو أساس العلاقة المتينة.',
  'لا تخف من التعبير عن مشاعرك، فالصدق ضروري في الحب.',
  'تعلم الاستسلام والتنازل، فالحب يتطلب التضحية والجهد المتبادل.',
  'فاجئ شريك حياتك من وقت لآخر، وحافظ على شرارة الرومانسية حية.',
  'احترم شخصية شريكك واسمح له بالنمو كشخص.',
  'حب الذات لا يقل أهمية عن حب شخص آخر؛ اعتني بنفسك وقدر نفسك.',
  'تذكر أن العلاقة الصحية تقوم على الثقة والاحترام المتبادلين.',
  'اختر الشخص الذي يكملك ويجعلك نسخة أفضل من نفسك.',
  'الحب الحقيقي لا يجعلك تشعر بأنك أقل، بل يجعلك تشعر أكثر.',
  'الحب فعل، هو اختيار يومي، يُزرع بالأفعال والأقوال.',
  'ابحث عن وظيفة تثير شغفك، ولن تشعر أبدًا أنك تعمل.',
  'كن استباقيًا وخذ زمام المبادرة في عملك، فهذا سيقدره رؤسائك.',
  'تعلم من أخطائك وإخفاقاتك، فهي فرص للنمو والتحسن.',
  'الحفاظ على موقف إيجابي والبحث عن حلول لتحديات العمل.',
  'قم ببناء علاقات جيدة مع زملائك، فالعمل الجماعي هو مفتاح النجاح.',
  'حدد أهدافًا واضحة وواقعية واعمل بإصرار على تحقيقها.',
  'لا تخف من طلب المساعدة أو طلب الإرشاد، فهناك دائمًا شيء جديد لتتعلمه.',
  'تعرف على إنجازاتك وقدرها، واحتفل بنجاحاتك مهما كانت صغيرة.',
  'ابحث عن التوازن بين عملك وحياتك الشخصية، فكلا الجانبين مهم.',
  'العمل جزء مهم من حياتك، لكنه ليس الشيء الوحيد الذي يحدد هويتك.',
  'ثق بنفسك وبقدرتك على تحقيق ما تخطط للقيام به.',
  'تصور أهدافك وأحلامك، تخيل كيف ستشعر عندما تحققها.',
  'ابحث عن الإلهام من أولئك الذين تغلبوا على عقبات مماثلة تواجهك.',
  'تقبل الإخفاقات كجزء من العملية، فهي فرص للتعلم والنمو.',
  'أحط نفسك بالأشخاص الإيجابيين الذين يدفعونك للأمام.',
  'كن متفتحًا وكن على استعداد لتعلم أشياء جديدة.',
  'تذكر لماذا بدأت عندما لا تشعر بالتحفيز؛ أعد الاتصال بهدفك.',
  'قسم أهدافك إلى خطوات صغيرة، من شأنها أن تجعل الطريق أكثر قابلية للتحقيق وأقل إرباكًا.',
  'لا تخف من مطاردة أحلامك، فالحياة أقصر من أن تعيشها مع الندم.',
  'ثق أنه بالجهد والمثابرة، يمكنك تحقيق أي شيء تضعه في ذهنك.',
];
