import { createHash } from 'crypto'
import { canLevelUp, xpRange } from '../lib/levelling.js'
import fetch from 'node-fetch'
import fs from 'fs'
const { levelling } = '../lib/levelling.js'
import moment from 'moment-timezone'
import { promises } from 'fs'
import { join } from 'path'
const time = moment.tz('Egypt').format('HH')
let wib = moment.tz('Egypt').format('HH:mm:ss')
//import db from '../lib/database.js'

let handler = async (m, {conn, usedPrefix, usedPrefix: _p, __dirname, text, isPrems}) => {
    let d = new Date(new Date + 3600000)
    let locale = 'ar'
    let week = d.toLocaleDateString(locale, { weekday: 'long' })
    let date = d.toLocaleDateString(locale, { day: 'numeric', month: 'long', year: 'numeric' })
    let _uptime = process.uptime() * 1000
    let uptime = clockString(_uptime)
let who = m.quoted ? m.quoted.sender : m.mentionedJid && m.mentionedJid[0] ? m.mentionedJid[0] : m.fromMe ? conn.user.jid : m.sender
if (!(who in global.db.data.users)) throw `✳️ The user is not found in my database`
let videoUrl = 'https://telegra.ph/file/11f2c090454f0afe044ee.png';
  let vn = './media/menu.mp3';
  const user = global.db.data.users[m.sender];
  const {money, joincount} = global.db.data.users[m.sender];
  const {exp, limit, level, role} = 
    global.db.data.users[m.sender];
let { min, xp, max } = xpRange(user.level, global.multiplier)
let username = conn.getName(who)
let math = max - xp
let sn = createHash('md5').update(who).digest('hex')
let totalreg = Object.keys(global.db.data.users).length;
let rtotalreg = Object.values(global.db.data.users).filter(user => user.registered == true).length 
let more = String.fromCharCode(8206)
let readMore = more.repeat(900) 
  const taguser = '@' +  m.sender.split('@s.whatsapp.net')[0];
let str = ` 
*◞⛩️بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ⛩️◜*
 ✯≼══━━﹂⛩️﹁━━══≽✯
*◞{إِنَّمَا ٱلتَّوۡبَةُ عَلَى ٱللَّهِ لِلَّذِينَ يَعۡمَلُونَ ٱلسُّوٓءَ بِجَهَٰلَةٖ ثُمَّ يَتُوبُونَ مِن قَرِيبٖ فَأُوْلَٰٓئِكَ يَتُوبُ ٱللَّهُ عَلَيۡهِمۡۗ وَكَانَ ٱللَّهُ عَلِيمًا حَكِيمٗا}◜*
✯≼══━━﹂⛩️﹁━━══≽✯
*🏮║اهلا وسهلا يا║《 ${taguser} 》*
*🏮║اسم البوت║《GOJO 》*
*🏮║اسم المطور║《 Omar 》*
*🏮║عدد المستخدمين║《 ${rtotalreg} 》*
*🏮║وقت التشغيل║《 ${uptime} 》*
*🏮║التوقيت║《 ${date} 》*
*🏮║الاصدار║《v.1 》*

*◞🏮 مـلاحـظـة 🛑 ◈◜*
*◞🏮 يـجـب عـلـيـك كـتـابـة نـقـطـة قـبـل كـل أمـر مـثـل ⇠ 『 .اوامر 』◈◜*
✯≼══━━﹂⛩️﹁━━══≽✯

*يرجى الإبلاغ عن أي مشكلة تواجهك وسنعمل على حلها في أقرب وقت ممكن❤️ او استخدم امر رساله-للمطور*

*قسم الديني🕋*
1. [.قرآن] - يجيبك بآية قرآنية.
2. [.الله] - أسماء الله الحسنى (اختار رقم الاسم والبوت سيظهره ومعناه).
3. [.اذكار الصـباح] - أذكار الصـباح كاملة.
4. [.اذكار المـساء] - أذكار المساء كاملة.
5. [.احاديث] - أحاديث نبوية.
6. [.دين] -  أسئلة دينية.  (مش شغال)
7. [.ايه] - يجييبلك ايت الكرسي.

*قسم الجروبات👥*
1. [.الجروب] - معلومات الجروب.
2. [.الاشباح] - الأعضاء غير المتفاعلين في الجروب.
3. [.حذف] - حذف رسالة محددة.
4. [.تحذير] - تحذير شخص (3 تحذيرات وبعدها طرد).
5. [.شيل-التحذير] - إزالة التحذير.
6. [.طرد] - طرد شخص محدد.
7. [.منشن] - منشن لجميع الأعضاء.
8. [.منشني] - منشن لك.
9. [.المشرفين] - قائمة مشرفي الجروب.
10. [.خفض] - خفض رتبة أدمن.
11. [.رفع] - رفع شخص إلى أدمن.
12. [.لينك] - جلب رابط الجروب.
13. [.اعاده] - تغيير رابط الجروب.
14. [.اختفاء] - إخفاء وجودك أونلاين من البوت (للإلغاء [.افك]).
15. [.توب] - عرض توب الجروب.
26. [.تغيرالترحيب] - تغيير رسالة الترحيب.]
27. [.تغيرالمغادره] - تغيير رسالة المغادر]
28. [.رفع] - رفع احد مشرف 
29. [.لينك] - يظهرلك لينك الجروب.
30. [.ريستارت] - يغير رابط دعوت الجروب.
31. [.ازالت المشرف] - يزبل احد المشرفين من الاشراف.
32. [.شيل-تحذير] - يزيل تحذير من شخص.
33. [.حذف] - يحذف رسالة محددة.
34. [.دعوه] - دعوت شخص الي الجروب.

*قسم السوشيال🗂️*
1. [.اغنيه] - جلب أغنية من اليوتيوب.
2. [.انستجرام] - بحث عن حساب على إنستجرام. (مش شغال)
3. [.انستا] - تحميل مقطع من إنستجرام. (مش شغال)
4. [.ستوري-انستا] - تحميل ستوري من إنستجرام. (مش شغال)
5. [.تيكتوك-صوره] - تحميل صورة من تيك توك. (مش شغال)
6. [.تيكتوك] - تحميل فيديو من تيك توك. (مش شغال)
7. [.يوتيوب] - بحث عن فيديو في يوتيوب.
8. [.فيس] - تحميل من فيسبوك. (مش شغال)
9. [.اكس] - تحميل فيديو من اكس. (مش شغال)

*قسم الشخصية👤*
1. [.نصيحه] - نصيحة عشوائية.
2. [.عباره رومناسيه] - عبارات رومانسية.
3. [.كت] - أسماء عشوائية.
4. [.شخصيه] - شخصية الشخص المحدد.

*قسم الأدوات⚙️*
1. [.بحث] - بحث في جوجل.
2. [.ترجمه] - ترجمة لأي لغة.
3. [.تحميل] - تحميل أي ملف.
4. [.ميديافاير] - تحميل ملف من ميديافاير.
5. [.مهكر] - تحميل تطبيق مدفوع أو مهكر. (مش شغال)
6. [.متجر] - جلب تطبيق من جوجل بلاي. (مش شغال)
7. [.باركود] - تحويل الرابط إلى باركود.
8. [.خلفيه] - جلب خلفية حسب الطلب. (مش شغال)
9. [.عميق] - تغيير الصوت إلى صوت عميق.
10. [.لكرتون] - تحويل الصورة إلى كارتون. (مش شغال)
11. [.لانمي] - تحويل الصورة إلى أنمي. (مش شغال)
12. [.جيف] - تحويل الفيديو إلى GIF.
13. [.لصوره] - تحويل الستيك إلى صورة. (مش شغال)
14. [.لفيديو] - تحويل الستيك إلى فيديو.
15. [.لصوت] - تحويل الفيديو إلى صوت.
16. [.سرقه] - سرقة ستيك.
17. [.زخرفه] - زخرفة النص.
18. [.انطق] - تحويل النص إلى صوت.
19. [.دمج] - دمج إيموجيين.
20. [.لريك] - تحويل الصوت إلى ريك.
21. [.تليجراف] - تحويل الملف إلى رابط.
22. [.فري بيك] - البحث عن صورة.
23. [.قطه] - صورة قطة.
24. [.بروفايلي] - ملفك الشخصي.
25. [.بنك]
26. [.لملصق] - تحويل الصورة إلى ملصق.
27. [.اقول]
28. [.جروب فتح او قفل]
29. [.تصميم] - يعملك صوره فيها الي هتكتبه.
30. [.رمزي] - يظهر رقمك التسلسلي.
31. [.ويكي] - يبحث لك علي اي شيء في موقع ويكي بيديا.
32. [.الطقس]
33. [.فيك] - يعمك ايميل فيك.
34. [.بنج] - يوريك سرعت نت.
35. [.مسح] - يمسحلك خلفيت اي صوره.
36. [.3فيديو] - يجيبلك اي فيديو من اليوتيوب ويحمله لك.
37. [.2فيديو] - يجيبلك اي قناهبدون تحميل
38. [.درايف] - يحملك اي ىملف من جوجل درايف.
39. [.mp3] - يجيبلك اي اغنيه من اليوتيوب ويحمله لك.

*قسم الرفاهية🕹️
1. [.اكس] - لعبة إكس أو.
2. [.اسألة] - تحدي أسئلة.
3. [.رياضيات] - تحديات رياضية.
4. [.صراحه] - أسئلة صراحة.
5. [.تحدي] - تحدي شخص في لعبة.
6. [.العب] - حجرة ورقة مقص ضد البوت.
7. [.حظ] - لعبة حظ.
8. [.الكلمات] - تجميع الحروف.
9. [.لو] - لعبة لو.
10. [.ذكاء] - تخمين ذكائك.
11. [.غباء] - تخمين غبائك.
12. [.الحب] - تخمين نسبة الحب.
13. [.القدوه] - تخمين قدوتك.
14. [.سؤال] - أسئلة عشوائية.
15. [.ميمز] - عرض ميمز.
16. [.ميمز انمي] - ميمز أنمي.
17. [.انمي] - معلومات عن أنمي.
18. [.زواج] - زواج شخصين.
19. [.تاج]
20. [.فعاليات]
21. [.الكره]
22. [.تحدي] _ لعبت حجر ورقه مقص
23. [.جمال]
24. [.تطقيم]
25. [.شخصيه] - ييحلل شخصيتك.
26. [.الدون] - يجبلك صوره لكرستيانو.
27. [.شبهي]
28. [.ميسي] - يجيبلك صوره لميسي.

*قسم الاكسبي⭐️*
1. [.راتب] - جلب الراتب.

*قسم التطبيقات*
1. [.تطبيق] - جلب أي تطبيق باسمه.

*قسم البوت🤖*
1. [.لفل] - مستوى تفاعلك مع البوت.
2. [.الماسي] - عرض مستوى الماسي.
3. [.يومي] - جلب هدية يومية.
4. [.تعدين] - التعدين.
5. [.شراء] - شراء الماس أو اكسبي.
6. [.عمل] - سؤال مقابل اكسبي.
7. [.هجوم] - سرقة اكسبي.
8. [.رمزي] - رقمك التسلسلي.
9. [.تصليح] - إصلاح أي مشكلة تواجهك.
10. [.بنك]
11. [.الماس] - شراء الماس

*قسم المطور👨🏼‍💻*
1. [.بلاغ] - التواصل مع المطور.
2. [.نشر] - نشر رسالة لجميع مستخدمي البوت.
3. [.جروبات] - جلب جميع الجروبات التي بداخلها البوت.
4. [.بريم] - تمييز شخص.
5. [.خفض-التميير] - خفض تمييز شخص.
6. [.المستخدين] - عدد مستخدمي البوت.
7. [.حظر | فك-حظر] - حظر أو فك حظر شات.
8. [.المحظورين] - قائمة المحظورين.
9. [.بان | فك البان] - حظر أو فك حظر مستخدم.
10. [.بلوك | رفع بلوك] - حظر أو رفع الحظر.
11. [.البلوكات] - قائمة المحظورين.
12. [.انضم] - دخول جروب.
13. [.أخرج] - خروج من جروب.
14. [.المميزين] - قائمة المميزين.
15. [.اضف-الماس] - إضافة ماس.
16. [.اضف-اكسبي] - إضافة اكسبي.
17. [.ادمن] - رفع شخص إلى أدمن في الجروب.

✯≼══━━﹂⛩️﹁━━══≽✯

*المطور:*
🤖┋*Omar*┋🤖
*https://api.whatsapp.com/send/?phone=01501991015*
‬`.trim();

conn.sendMessage(m.chat, {
        video: { url: videoUrl }, caption: str,
  mentions: [m.sender,global.conn.user.jid],
  gifPlayback: true,gifAttribution: 0
    }, { quoted: m });
}; 
handler.help = ['main']
handler.tags = ['group']
handler.command = ['7'] 

export default handler
function clockString(ms) {
    let h = isNaN(ms) ? '--' : Math.floor(ms / 3600000)
    let m = isNaN(ms) ? '--' : Math.floor(ms / 60000) % 60
    let s = isNaN(ms) ? '--' : Math.floor(ms / 1000) % 60
    return [h, m, s].map(v => v.toString().padStart(2, 0)).join(':')}

    function ucapan() {
      const time = moment.tz('Egypt').format('HH')
      let res = "بداية يوم سعيده ☀️"
      if (time >= 4) {
        res = "صباح الخير 🌄"
      }
      if (time >= 10) {
        res = "مساء الخير ☀️"
      }
      if (time >= 15) {
        res = "مساء الخير 🌇"
      }
      if (time >= 18) {
        res = "مساء الخير 🌙"
      }
      return res
      }
