

let handler = async (m, { command, text }) => m.reply(`

◞♠️ نـقـابـة ريـنـاي┆ルネ ♠️◜
‏⎔ ٠ ┈─ ━╼ •﹝♠️﹞• ╾━ ─┈‏ ٠ ⎔
♠️╎اسـتـمـارة الـدخـول ˼‏✨˹
✺‏ ⋅ ┄┄┄┉ •﹝♠️﹞• ┉┄┄┄ ⋅ ✺
 ⌬╎الـلـقـب : ↯
> ⇜ 』

⌬╎من انـمـي : ↯
> ⇜ 』

⌬╎مـن ويـن جـبـت الـرابـط : ↯
> ⇜ ا』

⌬╎قـادر انـك تـتـفـاعـل او لا : ↯
> ⇜ ا』
✺‏ ⋅ ┄┄┄┉ •﹝♠️﹞• ┉┄┄┄ ⋅ ✺
֎╎◞ ممنوع اختيار الولد لقب بنت و العكس صحيح و ممنوع الاختيار من انميات 18+ و انرتم.🤍◜
✺‏ ⋅ ┄┄┄┉ •﹝♠️﹞• ┉┄┄┄ ⋅ ✺
◞ريـنـاي حـيـث يـجـتـمـع الـسـلـطـة والـمـجـد♠️◜
`.trim(), null, m.mentionedJid ? {
  mentions: m.mentionedJid
} : {})

handler.help = ['استماره <teks>?']
handler.tags = ['استماره', 'fun']
handler.command = /^(استماره|8|استمارة|هاي|هلا|مرحبا)$/i

export default handler
